cfd/openfoam/compressible/rhoSimpleFoam/06_tetMesh/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ************************************************************************* //

surfaceFile "surfaceMeshes/geometry.fms";


maxCellSize 0.5;
minCellSize 0.1;


renameBoundary
{
    defaultType patch;
    
    newPatchNames
    {
        inlet
        {
            type    patch;
            newName inlet;
        }
        
        outlet
        {
            type    patch;
            newName outlet;
        }
        
        freestream
        {
            type    patch;
            newName freestream;
        }
        
        model
        {
            type    wall;
            newName inlet;
        }
    }
}

// ************************************************************************* //
